app/views/topics/index.html.erb

											<div class="reply_count">
												<%= pluralize(topic.replies.count, 'reply') %>
---
SELECT "replies".* FROM "replies" WHERE "replies"."topic_id" = 1 ORDER BY replies.created_at DESC
SELECT COUNT(*) FROM "replies" WHERE "replies"."topic_id" = 1