app/views/topics/show.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."topic_id" = 1 ORDER BY replies.created_at DESC
SELECT COUNT(*) FROM "replies" WHERE "replies"."topic_id" = 1
---
					<div class="reply_count">
						<%= pluralize(@topic.replies.count, 'reply') %>