app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 10
---
								<div class="post_comments">
									<%= link_to pluralize(post.comments.count, 'commment'), post %>	<i class="icon-share icon-black"></i>