app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 35 ORDER BY comments.created_at DESC
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 35
---
									<div class="comment_count">
										<%= pluralize(@post.comments.count, 'commment') %>