app/controllers/comments_controller.rb

  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.create(params[:comment])
  	@comment.user_id = current_user.id
  	if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "36"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "This is really cool."], ["created_at", Mon, 18 Feb 2013 01:55:46 UTC +00:00], ["post_id", 36], ["updated_at", Mon, 18 Feb 2013 01:55:46 UTC +00:00], ["user_id", nil]]
UPDATE "comments" SET "user_id" = 1, "updated_at" = '2013-02-18 01:55:46.085339' WHERE "comments"."id" = 1