app/controllers/posts_controller.rb

	def index
		@posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC

	def show
		@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "35"]]

	def create
		@post = Post.new(params[:post])
		@post.user = current_user
		if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 17 Feb 2013 22:20:24 UTC +00:00], ["title", "AgileFoo"], ["updated_at", Sun, 17 Feb 2013 22:20:24 UTC +00:00], ["url", "http://agilefoo.herokuapp.com"], ["user_id", 1]]