app/controllers/static_pages_controller.rb

  def profile
    # @last_voted_comments = Array.new(2) {Array.new(current_user.votes.count)}

  	@user = current_user
  	@last_posts = @user.posts.all(order:'created_at DESC').take(10)
    @last_tweets = []; @last_tweets = Twitter.user_timeline(@user.twitter.to_s).take(10) if !@user.twitter.blank?
   	@last_comments = @user.comments.all(order:'created_at DESC').take(10)
    @last_votes = @user.votes.all(order:'created_at DESC').take(10)
    # @last_voted_comments = @user.votes.comments.all(order:'created_at DESC').take(10)
   	@last_topics = @user.topics.all(order:'created_at DESC').take(10)
  	@last_replies = @user.replies.all(order:'created_at DESC').take(10)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY posts.created_at DESC, created_at DESC
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 1 ORDER BY comments.created_at DESC, created_at DESC
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = 1 ORDER BY created_at DESC
SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = 1 ORDER BY topics.created_at DESC, created_at DESC
SELECT "replies".* FROM "replies" WHERE "replies"."user_id" = 1 ORDER BY replies.created_at DESC, created_at DESC