app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics" ORDER BY topics.created_at DESC
---
	def index
		@topics = Topic.all

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? ORDER BY topics.created_at DESC LIMIT 1  [["id", "1"]]
---
	def show
		@topic = Topic.find(params[:id])

INSERT INTO "topics" ("created_at", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?)
---
	def create
		@topic = Topic.new(params[:topic])
		@topic.user = current_user
		if @topic.save